; domain
(define (domain depot)
(:requirements :strips :typing)
(:types
    place locatable - object
    depot distributor - place
    truck hoist surface - locatable
    pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action drive
  :parameters (?x - truck ?y - place ?z - place) 
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob6874) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate6)
	(at pallet1 depot1)
	(clear crate2)
	(at pallet2 depot2)
	(clear crate5)
	(at pallet3 distributor0)
	(clear crate0)
	(at pallet4 distributor1)
	(clear crate8)
	(at pallet5 distributor2)
	(clear crate1)
	(at pallet6 depot2)
	(clear pallet6)
	(at pallet7 distributor2)
	(clear crate7)
	(at pallet8 distributor0)
	(clear pallet8)
	(at pallet9 distributor0)
	(clear crate3)
	(at truck0 distributor1)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 distributor0)
	(on crate0 pallet3)
	(at crate1 distributor2)
	(on crate1 pallet5)
	(at crate2 depot1)
	(on crate2 pallet1)
	(at crate3 distributor0)
	(on crate3 pallet9)
	(at crate4 distributor1)
	(on crate4 pallet4)
	(at crate5 depot2)
	(on crate5 pallet2)
	(at crate6 depot0)
	(on crate6 pallet0)
	(at crate7 distributor2)
	(on crate7 pallet7)
	(at crate8 distributor1)
	(on crate8 crate4)
)

(:goal (and
		(on crate1 crate6)
		(on crate2 pallet5)
		(on crate3 crate2)
		(on crate4 pallet3)
		(on crate5 pallet8)
		(on crate6 crate5)
		(on crate7 crate4)
		(on crate8 pallet0)
	)
))

; plan
1. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 0 of 8
2. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 0 of 8
3. (lift hoist4 crate8 crate4 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist4) (on crate8 crate4)
   added: (lifting hoist4 crate8) (clear crate4)
   goals met: 0 of 8
4. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 0 of 8
5. (lift hoist3 crate0 pallet3 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 pallet3)
   added: (lifting hoist3 crate0) (clear pallet3)
   goals met: 0 of 8
6. (drop hoist3 crate0 crate3 distributor0)
   deleted: (lifting hoist3 crate0) (clear crate3)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 crate3)
   goals met: 0 of 8
7. (lift hoist5 crate1 pallet5 distributor2)
   deleted: (at crate1 distributor2) (clear crate1) (available hoist5) (on crate1 pallet5)
   added: (lifting hoist5 crate1) (clear pallet5)
   goals met: 0 of 8
8. (drop hoist5 crate1 crate7 distributor2)
   deleted: (lifting hoist5 crate1) (clear crate7)
   added: (available hoist5) (at crate1 distributor2) (clear crate1) (on crate1 crate7)
   goals met: 0 of 8
9. (lift hoist2 crate5 pallet2 depot2)
   deleted: (at crate5 depot2) (clear crate5) (available hoist2) (on crate5 pallet2)
   added: (lifting hoist2 crate5) (clear pallet2)
   goals met: 0 of 8
10. (load hoist2 crate5 truck1 depot2)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   goals met: 0 of 8
11. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 0 of 8
12. (unload hoist3 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist3)
   added: (lifting hoist3 crate5)
   goals met: 0 of 8
13. (drop hoist3 crate5 pallet8 distributor0)
   deleted: (lifting hoist3 crate5) (clear pallet8)
   added: (available hoist3) (at crate5 distributor0) (clear crate5) (on crate5 pallet8)
   goals met: 1 of 8
14. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 1 of 8
15. (load hoist4 crate8 truck1 distributor1)
   deleted: (lifting hoist4 crate8)
   added: (in crate8 truck1) (available hoist4)
   goals met: 1 of 8
16. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 1 of 8
17. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 1 of 8
18. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 1 of 8
19. (unload hoist0 crate8 truck1 depot0)
   deleted: (in crate8 truck1) (available hoist0)
   added: (lifting hoist0 crate8)
   goals met: 1 of 8
20. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 1 of 8
21. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist1) (on crate2 pallet1)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 1 of 8
22. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 1 of 8
23. (load hoist1 crate2 truck1 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   goals met: 1 of 8
24. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 1 of 8
25. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   goals met: 1 of 8
26. (unload hoist5 crate2 truck1 distributor2)
   deleted: (in crate2 truck1) (available hoist5)
   added: (lifting hoist5 crate2)
   goals met: 1 of 8
27. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   goals met: 1 of 8
28. (drop hoist5 crate2 pallet5 distributor2)
   deleted: (lifting hoist5 crate2) (clear pallet5)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 pallet5)
   goals met: 2 of 8
29. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 2 of 8
30. (lift hoist4 crate4 pallet4 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist4) (on crate4 pallet4)
   added: (lifting hoist4 crate4) (clear pallet4)
   goals met: 2 of 8
31. (load hoist4 crate4 truck0 distributor1)
   deleted: (lifting hoist4 crate4)
   added: (in crate4 truck0) (available hoist4)
   goals met: 2 of 8
32. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 2 of 8
33. (unload hoist3 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist3)
   added: (lifting hoist3 crate4)
   goals met: 2 of 8
34. (drop hoist3 crate4 pallet3 distributor0)
   deleted: (lifting hoist3 crate4) (clear pallet3)
   added: (available hoist3) (at crate4 distributor0) (clear crate4) (on crate4 pallet3)
   goals met: 3 of 8
35. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 3 of 8
36. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 3 of 8
37. (lift hoist5 crate1 crate7 distributor2)
   deleted: (at crate1 distributor2) (clear crate1) (available hoist5) (on crate1 crate7)
   added: (lifting hoist5 crate1) (clear crate7)
   goals met: 3 of 8
38. (load hoist5 crate1 truck0 distributor2)
   deleted: (lifting hoist5 crate1)
   added: (in crate1 truck0) (available hoist5)
   goals met: 3 of 8
39. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 3 of 8
40. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 3 of 8
41. (lift hoist5 crate7 pallet7 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 pallet7)
   added: (lifting hoist5 crate7) (clear pallet7)
   goals met: 3 of 8
42. (load hoist5 crate7 truck1 distributor2)
   deleted: (lifting hoist5 crate7)
   added: (in crate7 truck1) (available hoist5)
   goals met: 3 of 8
43. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   goals met: 3 of 8
44. (unload hoist3 crate7 truck1 distributor0)
   deleted: (in crate7 truck1) (available hoist3)
   added: (lifting hoist3 crate7)
   goals met: 3 of 8
45. (drop hoist3 crate7 crate4 distributor0)
   deleted: (lifting hoist3 crate7) (clear crate4)
   added: (available hoist3) (at crate7 distributor0) (clear crate7) (on crate7 crate4)
   goals met: 4 of 8
46. (load hoist0 crate8 truck0 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck0) (available hoist0)
   goals met: 4 of 8
47. (lift hoist0 crate6 pallet0 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 pallet0)
   added: (lifting hoist0 crate6) (clear pallet0)
   goals met: 4 of 8
48. (load hoist0 crate6 truck0 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck0) (available hoist0)
   goals met: 4 of 8
49. (unload hoist0 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist0)
   added: (lifting hoist0 crate8)
   goals met: 4 of 8
50. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 4 of 8
51. (unload hoist3 crate6 truck0 distributor0)
   deleted: (in crate6 truck0) (available hoist3)
   added: (lifting hoist3 crate6)
   goals met: 4 of 8
52. (drop hoist0 crate8 pallet0 depot0)
   deleted: (lifting hoist0 crate8) (clear pallet0)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 pallet0)
   goals met: 5 of 8
53. (drop hoist3 crate6 crate5 distributor0)
   deleted: (lifting hoist3 crate6) (clear crate5)
   added: (available hoist3) (at crate6 distributor0) (clear crate6) (on crate6 crate5)
   goals met: 6 of 8
54. (unload hoist3 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist3)
   added: (lifting hoist3 crate1)
   goals met: 6 of 8
55. (drop hoist3 crate1 crate6 distributor0)
   deleted: (lifting hoist3 crate1) (clear crate6)
   added: (available hoist3) (at crate1 distributor0) (clear crate1) (on crate1 crate6)
   goals met: 7 of 8
56. (lift hoist3 crate0 crate3 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 crate3)
   added: (lifting hoist3 crate0) (clear crate3)
   goals met: 7 of 8
57. (drop hoist3 crate0 crate1 distributor0)
   deleted: (lifting hoist3 crate0) (clear crate1)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 crate1)
   goals met: 7 of 8
58. (lift hoist3 crate3 pallet9 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist3) (on crate3 pallet9)
   added: (lifting hoist3 crate3) (clear pallet9)
   goals met: 7 of 8
59. (load hoist3 crate3 truck1 distributor0)
   deleted: (lifting hoist3 crate3)
   added: (in crate3 truck1) (available hoist3)
   goals met: 7 of 8
60. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   goals met: 7 of 8
61. (unload hoist5 crate3 truck1 distributor2)
   deleted: (in crate3 truck1) (available hoist5)
   added: (lifting hoist5 crate3)
   goals met: 7 of 8
62. (drop hoist5 crate3 crate2 distributor2)
   deleted: (lifting hoist5 crate3) (clear crate2)
   added: (available hoist5) (at crate3 distributor2) (clear crate3) (on crate3 crate2)
   goals met: 8 of 8
